# Pandas Comprehensive Tutorial
============================

This script provides a complete introduction to pandas, including:
- What is pandas and how it works
- Series and DataFrame concepts
- Common operations and indexing
- Conditional indexing and data wrangling
- Interactive exercises for students
- Complex exercises to test understanding

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

# SECTION 1: WHAT IS PANDAS?

Pandas is a powerful Python library for data manipulation and analysis. 
It provides data structures for efficiently storing and manipulating 
large datasets, along with tools for reading and writing data in 
various formats.

Key Features:
- DataFrame: 2D labeled data structure (like a spreadsheet)
- Series: 1D labeled array (like a column in a spreadsheet)
- Powerful indexing and selection capabilities
- Built-in data cleaning and preparation tools
- Integration with other data science libraries
- Fast performance for large datasets

Think of pandas as 'Excel on steroids' for Python!

## Datatypes in Python vs Pandas vs Numpy

![alt text](../images/dtypes.png)

# SECTION 2: SERIES - THE BUILDING BLOCK

A Series is a one-dimensional labeled array that can hold any data type.

It's like a column in a spreadsheet with an index.

In [47]:
# From a list
numbers = [10, 20, 30, 40, 50]
series_from_list = pd.Series(numbers)
print("Series from list:")
series_from_list

Series from list:

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [48]:
# From a list with custom index
custom_index = ['A', 'B', 'C', 'D', 'E']
series_custom_index = pd.Series(numbers, index=custom_index)
print("Series with custom index:")

series_custom_index

Series with custom index:

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [49]:
# From a dictionary
data_dict = {'Jan': 100, 'Feb': 150, 'Mar': 200, 'Apr': 175}
series_from_dict = pd.Series(data_dict)
print("Series from dictionary:")
series_from_dict

Series from dictionary:

Jan    100
Feb    150
Mar    200
Apr    175
dtype: int64

In [6]:
series_from_dict['Jan']

np.int64(100)

In [5]:
# Series operations
print("--- Series Operations ---")
print("Original series:", series_from_list)
print("Sum:", series_from_list.sum())
print("Mean:", series_from_list.mean())
print("Max:", series_from_list.max())
print("Min:", series_from_list.min())
print()

--- Series Operations ---
Original series: 0    10
1    20
2    30
3    40
4    50
dtype: int64
Sum: 150
Mean: 30.0
Max: 50
Min: 10

# SECTION 3: DATAFRAME - THE POWERHOUSE

A DataFrame is a 2D labeled data structure with columns that can be 
different types (numeric, string, boolean, etc.). Think of it as a 
collection of Series objects, or a spreadsheet with multiple columns.

In [50]:
# From a dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Age': [25, 30, 35, 28, 32],
    'City': ['NYC', 'LA', 'Chicago', 'Boston', 'Seattle'],
    'Salary': [50000, 60000, 70000, 55000, 65000]
}

df = pd.DataFrame(data)
print("DataFrame from dictionary:")

df

DataFrame from dictionary:

      Name  Age     City  Salary
0    Alice   25      NYC   50000
1      Bob   30       LA   60000
2  Charlie   35  Chicago   70000
3    Diana   28   Boston   55000
4      Eve   32  Seattle   65000

In [51]:
# From a list of lists
data_list = [
    ['Apple', 'Fruit', 0.5, 100],
    ['Carrot', 'Vegetable', 0.3, 50],
    ['Chicken', 'Meat', 8.0, 200],
    ['Rice', 'Grain', 2.0, 150]
]

columns = ['Food', 'Category', 'Price', 'Calories']
df_food = pd.DataFrame(data_list, columns=columns)
print("DataFrame from list of lists:")

df_food

DataFrame from list of lists:

      Food   Category  Price  Calories
0    Apple      Fruit    0.5       100
1   Carrot  Vegetable    0.3        50
2  Chicken       Meat    8.0       200
3     Rice      Grain    2.0       150

In [10]:
# Basic DataFrame information
print("--- DataFrame Information ---")
print("Shape (rows, columns):", df_food.shape)
print("Data types:")
print(df_food.dtypes)
print("\nColumn names:", list(df_food.columns))
print("Index:", list(df_food.index))
print()

--- DataFrame Information ---
Shape (rows, columns): (4, 4)
Data types:
Food         object
Category     object
Price       float64
Calories      int64
dtype: object

Column names: ['Food', 'Category', 'Price', 'Calories']
Index: [0, 1, 2, 3]

# SECTION 4: INDEXING AND SELECTION

Pandas provides powerful ways to select and filter data. Understanding 
indexing is crucial for effective data manipulation.

In [52]:
# From a dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Age': [25, 30, 35, 28, 32],
    'City': ['NYC', 'LA', 'Chicago', 'Boston', 'Seattle'],
    'Salary': [50000, 60000, 70000, 55000, 65000]
}

df = pd.DataFrame(data)
print("DataFrame from dictionary:")

df

DataFrame from dictionary:

      Name  Age     City  Salary
0    Alice   25      NYC   50000
1      Bob   30       LA   60000
2  Charlie   35  Chicago   70000
3    Diana   28   Boston   55000
4      Eve   32  Seattle   65000

In [14]:
# Column selection
print("--- Column Selection ---")
print("Select single column (returns Series):")
print(df['Name'])
print()

print("Select multiple columns (returns DataFrame):")
print(df[['Name', 'Age', 'Salary']])
print()

--- Column Selection ---
Select single column (returns Series):
0      Alice
1        Bob
2    Charlie
3      Diana
4        Eve
Name: Name, dtype: object

Select multiple columns (returns DataFrame):
      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    Diana   28   55000
4      Eve   32   65000

In [15]:
# Row selection
print("--- Row Selection ---")
print("Select first 3 rows:")
print(df.head(3))
print()

print("Select last 2 rows:")
print(df.tail(2))
print()

--- Row Selection ---
Select first 3 rows:
      Name  Age     City  Salary
0    Alice   25      NYC   50000
1      Bob   30       LA   60000
2  Charlie   35  Chicago   70000

Select last 2 rows:
    Name  Age     City  Salary
3  Diana   28   Boston   55000
4    Eve   32  Seattle   65000

## Indexing: loc vs iloc

In [16]:
# Position-based indexing with .iloc
print("--- Position-based Indexing (.iloc) ---")
print("First row (index 0):")
print(df.iloc[0])
print()

print("First 2 rows, first 2 columns:")
print(df.iloc[0:2, 0:2])
print()

print("Specific row and column (row 1, column 'Age'):")
print(df.iloc[1]['Age'])
print()

--- Position-based Indexing (.iloc) ---
First row (index 0):
Name      Alice
Age          25
City        NYC
Salary    50000
Name: 0, dtype: object

First 2 rows, first 2 columns:
    Name  Age
0  Alice   25
1    Bob   30

Specific row and column (row 1, column 'Age'):
30

In [17]:
# Label-based indexing with .loc
print("--- Label-based Indexing (.loc) ---")
print("Select rows by index label:")
print(df.loc[0:2])
print()

print("Select specific row and column:")
print(df.loc[0, 'Name'])
print()

--- Label-based Indexing (.loc) ---
Select rows by index label:
      Name  Age     City  Salary
0    Alice   25      NYC   50000
1      Bob   30       LA   60000
2  Charlie   35  Chicago   70000

Select specific row and column:
Alice

# SECTION 5: CONDITIONAL INDEXING

Conditional indexing (boolean indexing) allows you to filter data 
based on conditions, similar to WHERE clauses in SQL.

In [18]:
# Simple conditions
print("--- Simple Conditions ---")
print("People older than 30:")
print(df[df['Age'] > 30])
print()

print("People with salary >= 60000:")
print(df[df['Salary'] >= 60000])
print()

--- Simple Conditions ---
People older than 30:
      Name  Age     City  Salary
2  Charlie   35  Chicago   70000
4      Eve   32  Seattle   65000

People with salary >= 60000:
      Name  Age     City  Salary
1      Bob   30       LA   60000
2  Charlie   35  Chicago   70000
4      Eve   32  Seattle   65000

In [53]:
# Multiple conditions
print("--- Multiple Conditions ---")
print("People aged 25-30 AND salary < 60000:")
condition = (df['Age'] >= 25) & (df['Age'] <= 30) & (df['Salary'] < 60000)

df[condition]

--- Multiple Conditions ---
People aged 25-30 AND salary < 60000:

    Name  Age    City  Salary
0  Alice   25     NYC   50000
3  Diana   28  Boston   55000

In [20]:
# String conditions
print("--- String Conditions ---")
print("People from cities starting with 'B':")
print(df[df['City'].str.startswith('B')])
print()

print("People with names containing 'a' (case insensitive):")
print(df[df['Name'].str.contains('a', case=False)])
print()

--- String Conditions ---
People from cities starting with 'B':
    Name  Age    City  Salary
3  Diana   28  Boston   55000

People with names containing 'a' (case insensitive):
      Name  Age     City  Salary
0    Alice   25      NYC   50000
2  Charlie   35  Chicago   70000
3    Diana   28   Boston   55000

In [21]:
# isin() method
print("--- Using isin() ---")
print("People from NYC or LA:")
print(df[df['City'].isin(['NYC', 'LA'])])
print()

--- Using isin() ---
People from NYC or LA:
    Name  Age City  Salary
0  Alice   25  NYC   50000
1    Bob   30   LA   60000

# SECTION 6: DATA WRANGLING

Data wrangling involves cleaning, transforming, and preparing data 
for analysis. Pandas provides many tools for this.

In [22]:
# Adding/removing columns
print("--- Adding/Removing Columns ---")
df['Experience'] = df['Age'] - 22  # Assuming they started working at 22
print("Added Experience column:")
print(df)
print()

--- Adding/Removing Columns ---
Added Experience column:
      Name  Age     City  Salary  Experience
0    Alice   25      NYC   50000           3
1      Bob   30       LA   60000           8
2  Charlie   35  Chicago   70000          13
3    Diana   28   Boston   55000           6
4      Eve   32  Seattle   65000          10

In [23]:
# Remove a column
df_dropped = df.drop('Experience', axis=1)
print("After dropping Experience column:")
print(df_dropped)
print()

After dropping Experience column:
      Name  Age     City  Salary
0    Alice   25      NYC   50000
1      Bob   30       LA   60000
2  Charlie   35  Chicago   70000
3    Diana   28   Boston   55000
4      Eve   32  Seattle   65000

In [24]:
# Sorting
print("--- Sorting ---")
print("Sort by Age (ascending):")
print(df.sort_values('Age'))
print()

print("Sort by Salary (descending):")
print(df.sort_values('Salary', ascending=False))
print()

--- Sorting ---
Sort by Age (ascending):
      Name  Age     City  Salary  Experience
0    Alice   25      NYC   50000           3
3    Diana   28   Boston   55000           6
1      Bob   30       LA   60000           8
4      Eve   32  Seattle   65000          10
2  Charlie   35  Chicago   70000          13

Sort by Salary (descending):
      Name  Age     City  Salary  Experience
2  Charlie   35  Chicago   70000          13
4      Eve   32  Seattle   65000          10
1      Bob   30       LA   60000           8
3    Diana   28   Boston   55000           6
0    Alice   25      NYC   50000           3

In [25]:
# Grouping and aggregation
print("--- Grouping and Aggregation ---")
print("Average salary by city:")
city_salary = df.groupby('City')['Salary'].agg(['mean', 'count', 'min', 'max'])
print(city_salary)
print()

--- Grouping and Aggregation ---
Average salary by city:
            mean  count    min    max
City
Boston   55000.0      1  55000  55000
Chicago  70000.0      1  70000  70000
LA       60000.0      1  60000  60000
NYC      50000.0      1  50000  50000
Seattle  65000.0      1  65000  65000

In [26]:
# Handling missing data
print("--- Handling Missing Data ---")
df_with_nulls = df.copy()
df_with_nulls.loc[2, 'Salary'] = np.nan
df_with_nulls.loc[1, 'Age'] = np.nan

print("DataFrame with missing values:")
print(df_with_nulls)
print()

print("Check for missing values:")
print(df_with_nulls.isnull())
print()

print("Fill missing values:")
df_filled = df_with_nulls.fillna({'Salary': df_with_nulls['Salary'].mean(), 'Age': df_with_nulls['Age'].median()})
print(df_filled)
print()

--- Handling Missing Data ---
DataFrame with missing values:
      Name   Age     City   Salary  Experience
0    Alice  25.0      NYC  50000.0           3
1      Bob   NaN       LA  60000.0           8
2  Charlie  35.0  Chicago      NaN          13
3    Diana  28.0   Boston  55000.0           6
4      Eve  32.0  Seattle  65000.0          10

Check for missing values:
    Name    Age   City  Salary  Experience
0  False  False  False   False       False
1  False   True  False   False       False
2  False  False  False    True       False
3  False  False  False   False       False
4  False  False  False   False       False

Fill missing values:
      Name   Age     City   Salary  Experience
0    Alice  25.0      NYC  50000.0           3
1      Bob  30.0       LA  60000.0           8
2  Charlie  35.0  Chicago  57500.0          13
3    Diana  28.0   Boston  55000.0           6
4      Eve  32.0  Seattle  65000.0          10

# SECTION 7: ADVANCED DATAFRAME MANIPULATION

Advanced DataFrame manipulation includes merging/joining data (similar to SQL JOINs)
and sophisticated grouping operations. These are essential skills for working
with multiple datasets and complex data analysis.

## Merge and Join Operations

In [ ]:

print("--- Merge and Join Operations ---")
print("Merging DataFrames is similar to SQL JOIN operations.")

# Customers DataFrame
customers = pd.DataFrame({
    'customer_id': [1, 2, 3, 4, 5],
    'name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'email': ['alice@email.com', 'bob@email.com', 'charlie@email.com', 'diana@email.com', 'eve@email.com'],
    'city': ['NYC', 'LA', 'Chicago', 'Boston', 'Seattle']
})

print("Customers DataFrame:")
print(customers)
print()

# Orders DataFrame
orders = pd.DataFrame({
    'order_id': [101, 102, 103, 104, 105, 106],
    'customer_id': [1, 2, 1, 3, 4, 2],
    'product': ['Laptop', 'Mouse', 'Keyboard', 'Monitor', 'Headphones', 'Tablet'],
    'amount': [999, 25, 75, 299, 150, 399],
    'order_date': ['2024-01-15', '2024-01-16', '2024-01-17', '2024-01-18', '2024-01-19', '2024-01-20']
})

print("Orders DataFrame:")
print(orders)
print()

--- Merge and Join Operations ---
Merging DataFrames is similar to SQL JOIN operations.
Customers DataFrame:
   customer_id     name              email     city
0            1    Alice    alice@email.com      NYC
1            2      Bob      bob@email.com       LA
2            3  Charlie  charlie@email.com  Chicago
3            4    Diana    diana@email.com   Boston
4            5      Eve      eve@email.com  Seattle

Orders DataFrame:
   order_id  customer_id     product  amount  order_date
0       101            1      Laptop     999  2024-01-15
1       102            2       Mouse      25  2024-01-16
2       103            1    Keyboard      75  2024-01-17
3       104            3     Monitor     299  2024-01-18
4       105            4  Headphones     150  2024-01-19
5       106            2      Tablet     399  2024-01-20

In [30]:
# Inner Join (default merge type)
print("--- Inner Join (default) ---")
print("Combines rows where customer_id exists in both DataFrames:")
inner_merge = pd.merge(customers, orders, on='customer_id', how='inner')
print(inner_merge)
print()

--- Inner Join (default) ---
Combines rows where customer_id exists in both DataFrames:
   customer_id     name              email     city  order_id     product  \
0            1    Alice    alice@email.com      NYC       101      Laptop
1            1    Alice    alice@email.com      NYC       103    Keyboard
2            2      Bob      bob@email.com       LA       102       Mouse
3            2      Bob      bob@email.com       LA       106      Tablet
4            3  Charlie  charlie@email.com  Chicago       104     Monitor
5            4    Diana    diana@email.com   Boston       105  Headphones

   amount  order_date
0     999  2024-01-15
1      75  2024-01-17
2      25  2024-01-16
3     399  2024-01-20
4     299  2024-01-18
5     150  2024-01-19

In [31]:
# Left Join
print("--- Left Join ---")
print("Keeps all rows from left DataFrame (customers):")
left_merge = pd.merge(customers, orders, on='customer_id', how='left')
print(left_merge)
print()

--- Left Join ---
Keeps all rows from left DataFrame (customers):
   customer_id     name              email     city  order_id     product  \
0            1    Alice    alice@email.com      NYC     101.0      Laptop
1            1    Alice    alice@email.com      NYC     103.0    Keyboard
2            2      Bob      bob@email.com       LA     102.0       Mouse
3            2      Bob      bob@email.com       LA     106.0      Tablet
4            3  Charlie  charlie@email.com  Chicago     104.0     Monitor
5            4    Diana    diana@email.com   Boston     105.0  Headphones
6            5      Eve      eve@email.com  Seattle       NaN         NaN

   amount  order_date
0   999.0  2024-01-15
1    75.0  2024-01-17
2    25.0  2024-01-16
3   399.0  2024-01-20
4   299.0  2024-01-18
5   150.0  2024-01-19
6     NaN         NaN

In [32]:
# Right Join
print("--- Right Join ---")
print("Keeps all rows from right DataFrame (orders):")
right_merge = pd.merge(customers, orders, on='customer_id', how='right')
print(right_merge)
print()

--- Right Join ---
Keeps all rows from right DataFrame (orders):
   customer_id     name              email     city  order_id     product  \
0            1    Alice    alice@email.com      NYC       101      Laptop
1            2      Bob      bob@email.com       LA       102       Mouse
2            1    Alice    alice@email.com      NYC       103    Keyboard
3            3  Charlie  charlie@email.com  Chicago       104     Monitor
4            4    Diana    diana@email.com   Boston       105  Headphones
5            2      Bob      bob@email.com       LA       106      Tablet

   amount  order_date
0     999  2024-01-15
1      25  2024-01-16
2      75  2024-01-17
3     299  2024-01-18
4     150  2024-01-19
5     399  2024-01-20

In [33]:
# Outer Join
print("--- Outer Join ---")
print("Keeps all rows from both DataFrames:")
outer_merge = pd.merge(customers, orders, on='customer_id', how='outer')
print(outer_merge)
print()

--- Outer Join ---
Keeps all rows from both DataFrames:
   customer_id     name              email     city  order_id     product  \
0            1    Alice    alice@email.com      NYC     101.0      Laptop
1            1    Alice    alice@email.com      NYC     103.0    Keyboard
2            2      Bob      bob@email.com       LA     102.0       Mouse
3            2      Bob      bob@email.com       LA     106.0      Tablet
4            3  Charlie  charlie@email.com  Chicago     104.0     Monitor
5            4    Diana    diana@email.com   Boston     105.0  Headphones
6            5      Eve      eve@email.com  Seattle       NaN         NaN

   amount  order_date
0   999.0  2024-01-15
1    75.0  2024-01-17
2    25.0  2024-01-16
3   399.0  2024-01-20
4   299.0  2024-01-18
5   150.0  2024-01-19
6     NaN         NaN

In [34]:
# Merge with different column names
print("--- Merge with Different Column Names ---")
print("When joining columns have different names:")

customers_alt = customers.copy()
customers_alt.rename(columns={'customer_id': 'cust_id'}, inplace=True)

print("Customers with renamed column:")
print(customers_alt)
print()

print("Merge using left_on and right_on:")
merge_different_names = pd.merge(customers_alt, orders, 
                                left_on='cust_id', right_on='customer_id', 
                                how='inner')
print(merge_different_names)
print()

--- Merge with Different Column Names ---
When joining columns have different names:
Customers with renamed column:
   cust_id     name              email     city
0        1    Alice    alice@email.com      NYC
1        2      Bob      bob@email.com       LA
2        3  Charlie  charlie@email.com  Chicago
3        4    Diana    diana@email.com   Boston
4        5      Eve      eve@email.com  Seattle

Merge using left_on and right_on:
   cust_id     name              email     city  order_id  customer_id  \
0        1    Alice    alice@email.com      NYC       101            1
1        1    Alice    alice@email.com      NYC       103            1
2        2      Bob      bob@email.com       LA       102            2
3        2      Bob      bob@email.com       LA       106            2
4        3  Charlie  charlie@email.com  Chicago       104            3
5        4    Diana    diana@email.com   Boston       105            4

      product  amount  order_date
0      Laptop     999  2024-01-15
1    Keyboard      75  2024-01-17
2       Mouse      25  2024-01-16
3      Tablet     399  2024-01-20
4     Monitor     299  2024-01-18
5  Headphones     150  2024-01-19

In [ ]:
# Multiple key merge
print("--- Multiple Key Merge ---")
print("Merging on multiple columns:")

# Create DataFrames with multiple keys
employees = pd.DataFrame({
    'dept_id': [1, 1, 2, 2, 3],
    'emp_id': [101, 102, 201, 202, 301],
    'name': ['John', 'Jane', 'Bob', 'Alice', 'Charlie'],
    'salary': [50000, 55000, 60000, 65000, 70000]
})

departments = pd.DataFrame({
    'dept_id': [1, 1, 2, 2, 3],
    'emp_id': [101, 102, 201, 202, 301],
    'dept_name': ['IT', 'IT', 'HR', 'HR', 'Finance'],
    'location': ['Floor 1', 'Floor 1', 'Floor 2', 'Floor 2', 'Floor 3']
})

print("Employees DataFrame:")
print(employees)
print()

print("Departments DataFrame:")
print(departments)
print()

print("Merge on multiple keys (dept_id and emp_id):")
multi_key_merge = pd.merge(employees, departments, on=['dept_id', 'emp_id'])
print(multi_key_merge)
print()

## Advanced GroupBy Operations

In [35]:
# Advanced GroupBy Operations
print("--- Advanced GroupBy Operations ---")
print("GroupBy is one of pandas' most powerful features for data analysis.")

# Create a more complex dataset for grouping
sales_data = pd.DataFrame({
    'date': pd.date_range('2024-01-01', periods=20, freq='D'),
    'region': ['North', 'South', 'East', 'West'] * 5,
    'product': ['A', 'B', 'C', 'D'] * 5,
    'sales_amount': np.random.randint(100, 1000, 20),
    'units_sold': np.random.randint(10, 100, 20),
    'salesperson': ['John', 'Jane', 'Bob', 'Alice'] * 5
})

print("Sales Data:")
print(sales_data.head(10))
print()

--- Advanced GroupBy Operations ---
GroupBy is one of pandas' most powerful features for data analysis.
Sales Data:
        date region product  sales_amount  units_sold salesperson
0 2024-01-01  North       A           486          33        John
1 2024-01-02  South       B           549          48        Jane
2 2024-01-03   East       C           792          67         Bob
3 2024-01-04   West       D           944          17       Alice
4 2024-01-05  North       A           913          10        John
5 2024-01-06  South       B           757          47        Jane
6 2024-01-07   East       C           565          15         Bob
7 2024-01-08   West       D           101          10       Alice
8 2024-01-09  North       A           946          89        John
9 2024-01-10  South       B           571          96        Jane

In [36]:
# Basic grouping
print("--- Basic Grouping ---")
print("Group by region and calculate total sales:")
region_sales = sales_data.groupby('region')['sales_amount'].sum()
print(region_sales)
print()

--- Basic Grouping ---
Group by region and calculate total sales:
region
East     2735
North    3450
South    2725
West     2483
Name: sales_amount, dtype: int64

In [38]:
# Multiple aggregations
print("--- Multiple Aggregations ---")
print("Group by region and calculate multiple statistics:")
region_stats = sales_data.groupby('region').agg({
    'sales_amount': ['sum', 'mean', 'count', 'std'],
    'units_sold': ['sum', 'mean', 'max', 'min']
})
region_stats

--- Multiple Aggregations ---
Group by region and calculate multiple statistics:

       sales_amount                          units_sold
                sum   mean count         std        sum  mean max min
region
East           2735  547.0     5  183.887194        269  53.8  82  15
North          3450  690.0     5  237.275157        256  51.2  89  10
South          2725  545.0     5  224.120503        295  59.0  96  23
West           2483  496.6     5  384.783446        270  54.0  93  10

In [39]:
# Group by multiple columns
print("--- Group by Multiple Columns ---")
print("Group by region and product:")
region_product = sales_data.groupby(['region', 'product']).agg({
    'sales_amount': 'sum',
    'units_sold': 'sum'
}).reset_index()
region_product

--- Group by Multiple Columns ---
Group by region and product:

  region product  sales_amount  units_sold
0   East       C          2735         269
1  North       A          3450         256
2  South       B          2725         295
3   West       D          2483         270

In [40]:
# Custom aggregation functions
print("--- Custom Aggregation Functions ---")
print("Group by salesperson and calculate custom metrics:")

def custom_agg(x):
    return pd.Series({
        'total_sales': x['sales_amount'].sum(),
        'avg_order_value': x['sales_amount'].mean(),
        'num_orders': len(x),
        'best_day': x.loc[x['sales_amount'].idxmax(), 'date']
    })

salesperson_analysis = sales_data.groupby('salesperson').apply(custom_agg)
print(salesperson_analysis)
print()

--- Custom Aggregation Functions ---
Group by salesperson and calculate custom metrics:
             total_sales  avg_order_value  num_orders   best_day
salesperson
Alice               2483            496.6           5 2024-01-04
Bob                 2735            547.0           5 2024-01-03
Jane                2725            545.0           5 2024-01-06
John                3450            690.0           5 2024-01-09

In [41]:
# Transform operations
print("--- Transform Operations ---")
print("Add columns with group-level calculations:")

# Calculate percentage of total sales by region
sales_data['pct_of_region'] = sales_data.groupby('region')['sales_amount'].transform(
    lambda x: x / x.sum() * 100
)

print("Sales data with percentage of region total:")
print(sales_data[['region', 'sales_amount', 'pct_of_region']].head(10))
print()

--- Transform Operations ---
Add columns with group-level calculations:
Sales data with percentage of region total:
  region  sales_amount  pct_of_region
0  North           486      14.086957
1  South           549      20.146789
2   East           792      28.957952
3   West           944      38.018526
4  North           913      26.463768
5  South           757      27.779817
6   East           565      20.658135
7   West           101       4.067660
8  North           946      27.420290
9  South           571      20.954128

In [44]:
# Pivot tables
print("--- Pivot Tables ---")
print("Create a pivot table showing sales by region and product:")
pivot_table = sales_data.pivot_table(
    values='sales_amount',
    index='region',
    columns='product',
    aggfunc='sum',
    fill_value=0
)
pivot_table

--- Pivot Tables ---
Create a pivot table showing sales by region and product:

product     A     B     C     D
region
East        0     0  2735     0
North    3450     0     0     0
South       0  2725     0     0
West        0     0     0  2483

In [45]:
# Filter within groups
print("--- Filter Within Groups ---")
print("Keep only top 2 sales days per region:")

def top_n_sales(group, n=2):
    return group.nlargest(n, 'sales_amount')

top_sales_by_region = sales_data.groupby('region').apply(top_n_sales)
print("Top 2 sales days per region:")

top_sales_by_region[['region', 'date', 'sales_amount']]

--- Filter Within Groups ---
Keep only top 2 sales days per region:
Top 2 sales days per region:

          region       date  sales_amount
region
East   2    East 2024-01-03           792
       14   East 2024-01-15           633
North  8   North 2024-01-09           946
       4   North 2024-01-05           913
South  5   South 2024-01-06           757
       13  South 2024-01-14           675
West   3    West 2024-01-04           944
       11   West 2024-01-12           825

In [46]:
# Cross-tabulation
print("--- Cross-Tabulation ---")
print("Cross-tab of region vs product:")
cross_tab = pd.crosstab(sales_data['region'], sales_data['product'], 
                        values=sales_data['sales_amount'], aggfunc='sum')
cross_tab

--- Cross-Tabulation ---
Cross-tab of region vs product:

product       A       B       C       D
region
East        NaN     NaN  2735.0     NaN
North    3450.0     NaN     NaN     NaN
South       NaN  2725.0     NaN     NaN
West        NaN     NaN     NaN  2483.0

# SECTION 8: THE POWERFUL APPLY METHOD

The apply method is one of pandas' most versatile tools, allowing you to apply
custom functions to DataFrames, Series, or groups of data. It's like having
a Swiss Army knife for data transformation!

## Apply on Series

In [54]:
# Create a sample Series
sample_series = pd.Series([1, 4, 9, 16, 25, 36, 49, 64, 81, 100])
print("Original Series:")
sample_series

Original Series:

0      1
1      4
2      9
3     16
4     25
5     36
6     49
7     64
8     81
9    100
dtype: int64

In [55]:
# Apply mathematical functions
print("Square root of each number:")
sqrt_series = sample_series.apply(np.sqrt)
sqrt_series

Square root of each number:

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

In [56]:
# Apply custom function
def categorize_number(x):
    if x < 10:
        return 'Small'
    elif x < 50:
        return 'Medium'
    else:
        return 'Large'

print("Categorize numbers by size:")
categorized = sample_series.apply(categorize_number)
categorized

Categorize numbers by size:

0     Small
1     Small
2     Small
3    Medium
4    Medium
5    Medium
6    Medium
7     Large
8     Large
9     Large
dtype: object

In [57]:
# Apply with lambda functions
print("Double each number:")
doubled = sample_series.apply(lambda x: x * 2)
doubled

Double each number:

0      2
1      8
2     18
3     32
4     50
5     72
6     98
7    128
8    162
9    200
dtype: int64


## Apply on DataFrame columns

In [ ]:

# Apply on DataFrame columns
print("--- Apply on DataFrame Columns ---")
print("Apply functions to entire columns:")

In [58]:
sample_df = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'age': [25, 30, 35, 28, 32],
    'salary': [50000, 60000, 70000, 55000, 65000],
    'department': ['IT', 'HR', 'IT', 'Finance', 'Marketing']
})

print("Sample DataFrame:")
sample_df

Sample DataFrame:

      name  age  salary department
0    Alice   25   50000         IT
1      Bob   30   60000         HR
2  Charlie   35   70000         IT
3    Diana   28   55000    Finance
4      Eve   32   65000  Marketing

In [60]:
# Apply to string columns
print("Convert names to uppercase:")
sample_df['name_upper'] = sample_df['name'].apply(str.upper)
sample_df

Convert names to uppercase:

      name  age  salary department name_upper
0    Alice   25   50000         IT      ALICE
1      Bob   30   60000         HR        BOB
2  Charlie   35   70000         IT    CHARLIE
3    Diana   28   55000    Finance      DIANA
4      Eve   32   65000  Marketing        EVE

In [61]:
# Apply to numeric columns
print("Calculate salary with 10% bonus:")
sample_df['bonus'] = sample_df['salary'].apply(lambda x: x * 0.10)
sample_df

Calculate salary with 10% bonus:

      name  age  salary department name_upper   bonus
0    Alice   25   50000         IT      ALICE  5000.0
1      Bob   30   60000         HR        BOB  6000.0
2  Charlie   35   70000         IT    CHARLIE  7000.0
3    Diana   28   55000    Finance      DIANA  5500.0
4      Eve   32   65000  Marketing        EVE  6500.0

In [62]:
# Apply to multiple columns
print("Calculate total compensation (salary + bonus):")
sample_df['total_comp'] = sample_df.apply(
    lambda row: row['salary'] + row['bonus'], axis=1
)
sample_df

Calculate total compensation (salary + bonus):

      name  age  salary department name_upper   bonus  total_comp
0    Alice   25   50000         IT      ALICE  5000.0     55000.0
1      Bob   30   60000         HR        BOB  6000.0     66000.0
2  Charlie   35   70000         IT    CHARLIE  7000.0     77000.0
3    Diana   28   55000    Finance      DIANA  5500.0     60500.0
4      Eve   32   65000  Marketing        EVE  6500.0     71500.0

## Apply on DataFrame rows (axis=1)

In [63]:
# Create a more complex DataFrame
employees = pd.DataFrame({
    'first_name': ['John', 'Jane', 'Bob', 'Alice', 'Charlie'],
    'last_name': ['Smith', 'Doe', 'Johnson', 'Brown', 'Wilson'],
    'hours_worked': [40, 35, 45, 38, 42],
    'hourly_rate': [25, 30, 22, 28, 26],
    'overtime_hours': [5, 0, 10, 2, 8]
})

print("Employees DataFrame:")
employees

Employees DataFrame:

  first_name last_name  hours_worked  hourly_rate  overtime_hours
0       John     Smith            40           25               5
1       Jane       Doe            35           30               0
2        Bob   Johnson            45           22              10
3      Alice     Brown            38           28               2
4    Charlie    Wilson            42           26               8

In [64]:
# Calculate weekly pay for each employee
def calculate_weekly_pay(row):
    regular_pay = row['hours_worked'] * row['hourly_rate']
    overtime_pay = row['overtime_hours'] * row['hourly_rate'] * 1.5
    return regular_pay + overtime_pay

employees['weekly_pay'] = employees.apply(calculate_weekly_pay, axis=1)
print("Employees with weekly pay calculation:")
employees

Employees with weekly pay calculation:

  first_name last_name  hours_worked  hourly_rate  overtime_hours  weekly_pay
0       John     Smith            40           25               5      1187.5
1       Jane       Doe            35           30               0      1050.0
2        Bob   Johnson            45           22              10      1320.0
3      Alice     Brown            38           28               2      1148.0
4    Charlie    Wilson            42           26               8      1404.0

In [65]:
# Apply with conditional logic
def categorize_employee(row):
    if row['weekly_pay'] > 1500:
        return 'High Earner'
    elif row['weekly_pay'] > 1000:
        return 'Medium Earner'
    else:
        return 'Low Earner'

employees['earner_category'] = employees.apply(categorize_employee, axis=1)
print("Employees with earning categories:")
employees

Employees with earning categories:

,first_name,last_name,hours_worked,hourly_rate,overtime_hours,weekly_pay,earner_category
0,John,Smith,40,25,5,1187.5,Medium Earner
1,Jane,Doe,35,30,0,1050.0,Medium Earner
2,Bob,Johnson,45,22,10,1320.0,Medium Earner
3,Alice,Brown,38,28,2,1148.0,Medium Earner
4,Charlie,Wilson,42,26,8,1404.0,Medium Earner

In [66]:
# Apply with multiple return values
def analyze_employee(row):
    efficiency = row['hours_worked'] / (row['hours_worked'] + row['overtime_hours'])
    cost_per_hour = row['weekly_pay'] / (row['hours_worked'] + row['overtime_hours'])
    return pd.Series({
        'efficiency': round(efficiency, 2),
        'cost_per_hour': round(cost_per_hour, 2)
    })

# Apply and expand results
analysis_results = employees.apply(analyze_employee, axis=1)
analysis_results

   efficiency  cost_per_hour
0        0.89          26.39
1        1.00          30.00
2        0.82          24.00
3        0.95          28.70
4        0.84          28.08

In [67]:
employees = pd.concat([employees, analysis_results], axis=1)
employees

,first_name,last_name,hours_worked,hourly_rate,overtime_hours,weekly_pay,earner_category,efficiency,cost_per_hour
0,John,Smith,40,25,5,1187.5,Medium Earner,0.89,26.39
1,Jane,Doe,35,30,0,1050.0,Medium Earner,1.00,30.00
2,Bob,Johnson,45,22,10,1320.0,Medium Earner,0.82,24.00
3,Alice,Brown,38,28,2,1148.0,Medium Earner,0.95,28.70
4,Charlie,Wilson,42,26,8,1404.0,Medium Earner,0.84,28.08

In [68]:
# Apply with groupby
print("--- Apply with GroupBy ---")
print("Apply functions to groups of data:")

# Create sales data for grouping
sales_group_data = pd.DataFrame({
    'region': ['North', 'South', 'East', 'West'] * 3,
    'product': ['A', 'B', 'C'] * 4,
    'sales': [100, 150, 200, 120, 180, 220, 90, 160, 190, 110, 170, 210],
    'cost': [60, 90, 120, 70, 100, 130, 50, 85, 110, 65, 95, 125]
})

print("Sales data for grouping:")
print(sales_group_data)
print()

--- Apply with GroupBy ---
Apply functions to groups of data:
Sales data for grouping:
   region product  sales  cost
0   North       A    100    60
1   South       B    150    90
2    East       C    200   120
3    West       A    120    70
4   North       B    180   100
5   South       C    220   130
6    East       A     90    50
7    West       B    160    85
8   North       C    190   110
9   South       A    110    65
10   East       B    170    95
11   West       C    210   125

In [69]:
# Apply custom function to each group
def analyze_group(group):
    return pd.Series({
        'total_sales': group['sales'].sum(),
        'total_cost': group['cost'].sum(),
        'profit': group['sales'].sum() - group['cost'].sum(),
        'profit_margin': (group['sales'].sum() - group['cost'].sum()) / group['sales'].sum() * 100,
        'avg_sale': group['sales'].mean(),
        'num_transactions': len(group)
    })

# Apply to groups
group_analysis = sales_group_data.groupby('region').apply(analyze_group)
print("Group analysis by region:")
group_analysis

Group analysis by region:

,total_sales,total_cost,profit,profit_margin,avg_sale,num_transactions
region,,,,,,
East,460.0,265.0,195.0,42.391304,153.333333,3.0
North,470.0,270.0,200.0,42.553191,156.666667,3.0
South,480.0,285.0,195.0,40.625000,160.000000,3.0
West,490.0,280.0,210.0,42.857143,163.333333,3.0

## Vectorized operations vs apply

In [70]:
print("--- Vectorized Operations vs Apply ---")
print("When to use apply vs vectorized operations:")

# Create a large dataset for comparison
large_data = pd.DataFrame({
    'x': np.random.randn(10000),
    'y': np.random.randn(10000)
})

print("Large dataset shape:", large_data.shape)
print()

# Vectorized operation (faster)
print("Vectorized operation (recommended):")
vectorized_result = large_data['x'] ** 2 + large_data['y'] ** 2
print("Result shape:", vectorized_result.shape)
print("First 5 values:", vectorized_result.head().values)
print()

--- Vectorized Operations vs Apply ---
When to use apply vs vectorized operations:
Large dataset shape: (10000, 2)

Vectorized operation (recommended):
Result shape: (10000,)
First 5 values: [2.26835218 1.0663473  1.87248331 0.96226409 1.54311486]

In [71]:
# Apply operation (slower for large datasets)
print("Apply operation (use sparingly for large datasets):")
def vector_operation(row):
    return row['x'] ** 2 + row['y'] ** 2

apply_result = large_data.apply(vector_operation, axis=1)
print("Result shape:", apply_result.shape)
print("First 5 values:", apply_result.head().values)
print()

print("Note: Vectorized operations are much faster for large datasets!")
print("Use apply when you need custom logic that can't be vectorized.")
print()

Apply operation (use sparingly for large datasets):
Result shape: (10000,)
First 5 values: [2.26835218 1.0663473  1.87248331 0.96226409 1.54311486]

Note: Vectorized operations are much faster for large datasets!
Use apply when you need custom logic that can't be vectorized.

# SECTION 9: STUDENT EXERCISES

This document contains all the exercises from the pandas comprehensive tutorial, organized by difficulty level and concept area.

### Exercise 1: Basic Creation
**Objective:** Create Series and DataFrames from scratch

**Tasks:**
- Create a Series with the numbers 1, 4, 9, 16, 25 and labels 'a', 'b', 'c', 'd', 'e'
- Create a DataFrame with columns: 'Product', 'Price', 'Stock' and at least 3 rows of data

**Expected Output:** Series with square numbers, DataFrame with product information

In [73]:
# Sample data for reference
sample_series_data = [1, 4, 9, 16, 25]
sample_series_labels = ['a', 'b', 'c', 'd', 'e']

sample_products = ['Laptop', 'Mouse', 'Keyboard', 'Monitor', 'Headphones']
sample_prices = [999, 25, 75, 299, 150]
sample_stock = [10, 50, 30, 15, 25]

### Exercise 2: Indexing and Selection
**Objective:** Practice various indexing and selection methods

**Tasks:** From the DataFrame 'df' created:
- Select only the 'Name' and 'City' columns
- Select the first 2 rows
- Select people older than 28
- Select people with salary between 50000 and 70000

In [74]:
# Sample DataFrame for this exercise
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Frank', 'Grace'],
    'Age': [25, 30, 35, 28, 32, 29, 27],
    'City': ['NYC', 'LA', 'Chicago', 'Boston', 'Seattle', 'Miami', 'Denver'],
    'Salary': [50000, 60000, 70000, 55000, 65000, 58000, 52000],
    'Department': ['IT', 'HR', 'IT', 'Finance', 'Marketing', 'Sales', 'IT']
})
df

      Name  Age     City  Salary Department
0    Alice   25      NYC   50000         IT
1      Bob   30       LA   60000         HR
2  Charlie   35  Chicago   70000         IT
3    Diana   28   Boston   55000    Finance
4      Eve   32  Seattle   65000  Marketing
5    Frank   29    Miami   58000      Sales
6    Grace   27   Denver   52000         IT

### Exercise 3: Data Manipulation
**Objective:** Learn basic data manipulation techniques

**Tasks:** From the DataFrame 'df':
- Add a new column 'Bonus' that is 10% of salary
- Sort the data by age in descending order
- Calculate the average salary by city
- Find the person with the highest salary

In [75]:
# Use the same DataFrame from Exercise 2
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Frank', 'Grace'],
    'Age': [25, 30, 35, 28, 32, 29, 27],
    'City': ['NYC', 'LA', 'Chicago', 'Boston', 'Seattle', 'Miami', 'Denver'],
    'Salary': [50000, 60000, 70000, 55000, 65000, 58000, 52000],
    'Department': ['IT', 'HR', 'IT', 'Finance', 'Marketing', 'Sales', 'IT']
})
df

      Name  Age     City  Salary Department
0    Alice   25      NYC   50000         IT
1      Bob   30       LA   60000         HR
2  Charlie   35  Chicago   70000         IT
3    Diana   28   Boston   55000    Finance
4      Eve   32  Seattle   65000  Marketing
5    Frank   29    Miami   58000      Sales
6    Grace   27   Denver   52000         IT

### Exercise 4: Conditional Operations
**Objective:** Master conditional filtering and boolean indexing

**Tasks:** Create a new DataFrame that contains:
- People from cities with more than 3 letters
- People whose names start with a vowel (A, E, I, O, U)
- People with age + salary > 80000

In [76]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Frank', 'Grace'],
    'Age': [25, 30, 35, 28, 32, 29, 27],
    'City': ['NYC', 'LA', 'Chicago', 'Boston', 'Seattle', 'Miami', 'Denver'],
    'Salary': [50000, 60000, 70000, 55000, 65000, 58000, 52000],
    'Department': ['IT', 'HR', 'IT', 'Finance', 'Marketing', 'Sales', 'IT']
})
df

      Name  Age     City  Salary Department
0    Alice   25      NYC   50000         IT
1      Bob   30       LA   60000         HR
2  Charlie   35  Chicago   70000         IT
3    Diana   28   Boston   55000    Finance
4      Eve   32  Seattle   65000  Marketing
5    Frank   29    Miami   58000      Sales
6    Grace   27   Denver   52000         IT

### Exercise 5: Data Cleaning
**Objective:** Practice handling missing data and data cleaning

**Tasks:** 
- Identify all missing values
- Fill numeric missing values with median
- Fill string missing values with 'Unknown'
- Remove any rows that still have missing values

In [77]:
# Sample DataFrame with missing values for this exercise
df_missing = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Frank', 'Grace'],
    'Age': [25, 30, np.nan, 28, 32, 29, np.nan],
    'City': ['NYC', 'LA', 'Chicago', 'Boston', 'Seattle', np.nan, 'Denver'],
    'Salary': [50000, 60000, 70000, 55000, 65000, 58000, 52000],
    'Department': ['IT', 'HR', 'IT', 'Finance', 'Marketing', 'Sales', 'IT'],
    'Experience': [2, 5, np.nan, 3, 7, 4, 1]
})
df_missing

      Name   Age     City  Salary Department  Experience
0    Alice  25.0      NYC   50000         IT         2.0
1      Bob  30.0       LA   60000         HR         5.0
2  Charlie   NaN  Chicago   70000         IT         NaN
3    Diana  28.0   Boston   55000    Finance         3.0
4      Eve  32.0  Seattle   65000  Marketing         7.0
5    Frank  29.0      NaN   58000      Sales         4.0
6    Grace   NaN   Denver   52000         IT         1.0

### Exercise 6: Merge and Join Operations
**Objective:** Master SQL-like JOIN operations in pandas

**Required Operations:**
- Perform an inner join to see all students with their courses
- Perform a left join to see all students (even those without courses)
- Perform a right join to see all courses (even those without students)
- Calculate average GPA by major for students who have taken courses

In [78]:
students = pd.DataFrame({
    'student_id': [1, 2, 3, 4, 5, 6, 7],
    'name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Frank', 'Grace'],
    'major': ['CS', 'Math', 'CS', 'Physics', 'Math', 'Engineering', 'Biology'],
    'gpa': [3.8, 3.5, 3.9, 3.7, 3.6, 3.4, 3.8]
})

# DataFrame 2: Courses
courses = pd.DataFrame({
    'course_id': [101, 102, 103, 104, 105, 106, 107, 108],
    'student_id': [1, 1, 2, 3, 4, 5, 6, 7],
    'course_name': ['Python', 'Data Structures', 'Calculus', 'Algorithms', 'Thermodynamics', 'Linear Algebra', 'Mechanics', 'Genetics'],
    'grade': ['A', 'A-', 'B+', 'A', 'B', 'A-', 'B+', 'A']
})

### Exercise 7: Advanced GroupBy Operations
**Objective:** Master sophisticated grouping and aggregation

**Required Operations:**
- Group by region and calculate total sales, average order value, and count
- Group by region and product to see sales breakdown
- Find the top 3 salespeople by total sales
- Calculate the percentage of total sales each product contributes
- Create a pivot table showing sales by region and product

In [81]:
# Create date range for last 30 days
dates = pd.date_range('2024-01-01', periods=30, freq='D')

# Generate sample sales data
np.random.seed(42)  # For reproducible results
sales_data = pd.DataFrame({
    'date': np.random.choice(dates, 100),
    'product': np.random.choice(['Laptop', 'Mouse', 'Keyboard', 'Monitor', 'Headphones'], 100),
    'region': np.random.choice(['North', 'South', 'East', 'West'], 100),
    'salesperson': np.random.choice(['John', 'Jane', 'Bob', 'Alice', 'Charlie'], 100),
    'amount': np.random.randint(100, 2000, 100)
})
sales_data

         date     product region salesperson  amount
0  2024-01-07       Mouse   West        Jane     345
1  2024-01-20     Monitor   East         Bob    1299
2  2024-01-29     Monitor   East       Alice    1162
3  2024-01-15      Laptop  South        Jane    1600
4  2024-01-11  Headphones   West        John    1805
..        ...         ...    ...         ...     ...
95 2024-01-29  Headphones  North        Jane     733
96 2024-01-18      Laptop  South        John     612
97 2024-01-26    Keyboard   East        John    1874
98 2024-01-12       Mouse   East        John     901
99 2024-01-02     Monitor  South         Bob    1219

[100 rows x 5 columns]

### Exercise 8: The Apply Method
**Objective:** Master the versatile apply method for custom operations

**Required Operations:**
- Use apply to calculate the average score for each student
- Use apply to categorize students as 'Excellent' (>90), 'Good' (80-90), 'Average' (70-80), 'Below Average' (<70)
- Use apply to create a 'grade_point' column (A=4.0, B=3.0, C=2.0, D=1.0, F=0.0)
- Use apply with axis=1 to calculate a 'performance_index' (weighted average: math*0.4, science*0.35, english*0.25)
- Use apply to find the subject with the highest score for each student

In [82]:
# Sample student dataset for this exercise
students_scores = pd.DataFrame({
    'student_id': [1, 2, 3, 4, 5, 6, 7, 8],
    'name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Frank', 'Grace', 'Henry'],
    'math_score': [95, 87, 92, 78, 88, 91, 85, 79],
    'science_score': [88, 91, 85, 82, 90, 87, 89, 84],
    'english_score': [92, 85, 89, 75, 87, 90, 83, 88]
})
students_scores

   student_id     name  math_score  science_score  english_score
0           1    Alice          95             88             92
1           2      Bob          87             91             85
2           3  Charlie          92             85             89
3           4    Diana          78             82             75
4           5      Eve          88             90             87
5           6    Frank          91             87             90
6           7    Grace          85             89             83
7           8    Henry          79             84             88

## Complex Exercises (Advanced Projects)

### Complex Exercise 1: Sales Analysis
**Objective:** Business intelligence and sales analytics

**Tasks:**
1. Calculate daily, weekly, and monthly sales totals
2. Find top 5 products by revenue and units sold
3. Analyze sales performance by region and salesperson
4. Identify customer segments with highest average order value
5. Create a pivot table showing sales by category and region

In [83]:
# Set random seed for reproducibility
np.random.seed(42)

# Create date range for last 30 days
dates = pd.date_range('2024-01-01', periods=30, freq='D')

# Generate sample data
n_records = 200
sales_comprehensive = pd.DataFrame({
    'Date': np.random.choice(dates, n_records),
    'Product_ID': np.random.randint(1001, 1011, n_records),
    'Product_Name': np.random.choice(['Laptop Pro', 'Wireless Mouse', 'Mechanical Keyboard', '4K Monitor', 
                                     'Noise-Canceling Headphones', 'Webcam HD', 'USB-C Hub', 'SSD 1TB', 
                                     'RAM 16GB', 'Graphics Card'], n_records),
    'Category': np.random.choice(['Electronics', 'Accessories', 'Components'], n_records),
    'Sales_Amount': np.random.randint(50, 2500, n_records),
    'Units_Sold': np.random.randint(1, 10, n_records),
    'Customer_ID': np.random.randint(10001, 10101, n_records),
    'Customer_Segment': np.random.choice(['Premium', 'Standard', 'Budget'], n_records),
    'Region': np.random.choice(['North', 'South', 'East', 'West', 'Central'], n_records),
    'Salesperson_ID': np.random.randint(2001, 2011, n_records)
})
sales_comprehensive

,Date,Product_ID,Product_Name,Category,Sales_Amount,Units_Sold,Customer_ID,Customer_Segment,Region,Salesperson_ID
0,2024-01-07,1007,RAM 16GB,Accessories,317,2,10055,Premium,South,2010
1,2024-01-20,1004,Webcam HD,Components,2034,4,10092,Standard,Central,2006
2,2024-01-29,1007,USB-C Hub,Accessories,1127,1,10032,Standard,West,2007
3,2024-01-15,1003,Graphics Card,Components,285,5,10050,Premium,Central,2002
4,2024-01-11,1006,USB-C Hub,Accessories,438,9,10007,Standard,West,2006
...,...,...,...,...,...,...,...,...,...,...
195,2024-01-29,1002,USB-C Hub,Accessories,1992,3,10008,Budget,North,2008
196,2024-01-04,1010,RAM 16GB,Accessories,1723,3,10095,Standard,Central,2006
197,2024-01-30,1001,USB-C Hub,Accessories,2269,2,10021,Budget,North,2005
198,2024-01-05,1008,Noise-Canceling Headphones,Components,2110,1,10081,Premium,Central,2006
199,2024-01-23,1001,Graphics Card,Components,1241,7,10087,Standard,West,2002

### Complex Exercise 2: Customer Churn Analysis
**Objective:** Customer analytics and retention analysis

**Tasks:**
1. Calculate customer lifetime value for each customer
2. Identify factors correlated with churn using conditional indexing
3. Create customer segments based on usage patterns
4. Analyze churn rates by demographic and subscription factors
5. Build a summary report with key insights and recommendations

In [85]:
from datetime import datetime, timedelta

# Set random seed for reproducibility
np.random.seed(42)

# Generate sample customer data
n_customers = 1000
customers = pd.DataFrame({
    'customer_id': range(1, n_customers + 1),
    'age': np.random.normal(35, 12, n_customers).clip(18, 80).astype(int),
    'gender': np.random.choice(['Male', 'Female'], n_customers),
    'location': np.random.choice(['Urban', 'Suburban', 'Rural'], n_customers),
    'subscription_plan': np.random.choice(['Basic', 'Premium', 'Enterprise'], n_customers, p=[0.5, 0.3, 0.2]),
    'start_date': [datetime.now() - timedelta(days=np.random.randint(30, 1000)) for _ in range(n_customers)],
    'monthly_fee': np.random.choice([29, 49, 99], n_customers),
    'monthly_calls': np.random.poisson(50, n_customers),
    'monthly_data_usage_gb': np.random.exponential(5, n_customers),
    'support_tickets_last_6m': np.random.poisson(2, n_customers),
    'payment_method': np.random.choice(['Credit Card', 'Debit Card', 'Bank Transfer'], n_customers),
    'churned': np.random.choice([0, 1], n_customers, p=[0.8, 0.2])  # 20% churn rate
})

# Calculate tenure in months
customers['tenure_months'] = ((datetime.now() - customers['start_date']).dt.days / 30).astype(int)
customers

,customer_id,age,gender,location,subscription_plan,start_date,monthly_fee,monthly_calls,monthly_data_usage_gb,support_tickets_last_6m,payment_method,churned,tenure_months
0,1,40,Male,Rural,Basic,2025-01-10 17:46:26.119050,29,62,0.396853,1,Bank Transfer,1,7
1,2,33,Female,Urban,Basic,2023-06-17 17:46:26.119068,49,46,6.596922,2,Bank Transfer,1,26
2,3,42,Male,Urban,Basic,2024-10-13 17:46:26.119072,99,52,4.797097,5,Credit Card,0,10
3,4,53,Female,Rural,Premium,2025-04-09 17:46:26.119075,49,46,0.014580,2,Credit Card,0,4
4,5,32,Male,Rural,Premium,2024-02-20 17:46:26.119078,49,47,0.047323,0,Debit Card,0,18
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,31,Female,Rural,Enterprise,2025-06-02 17:46:26.121437,49,42,1.437436,3,Credit Card,1,3
996,997,56,Male,Rural,Basic,2025-02-21 17:46:26.121439,99,54,2.050839,2,Credit Card,0,6
997,998,42,Female,Urban,Premium,2025-07-09 17:46:26.121442,49,44,4.447713,0,Bank Transfer,0,1
998,999,28,Male,Suburban,Basic,2024-09-28 17:46:26.121444,99,46,3.029550,1,Bank Transfer,0,11
999,1000,41,Male,Rural,Basic,2024-10-24 17:46:26.121446,29,54,6.835299,5,Credit Card,0,10

### Complex Exercise 3: E-commerce Analytics
**Objective:** Online business metrics and customer journey analysis

**Tasks:**
1. Calculate conversion rates from browsing to purchase
2. Analyze customer journey and identify drop-off points
3. Find products frequently bought together (market basket analysis)
4. Calculate customer acquisition cost and return on ad spend
5. Create a comprehensive dashboard summary with visualizations

In [86]:
from datetime import datetime, timedelta

# Set random seed for reproducibility
np.random.seed(42)

# Generate sample e-commerce data
n_customers = 500
n_products = 50
n_orders = 2000

# Customer behavior data
customer_behavior = pd.DataFrame({
    'customer_id': np.random.randint(1, n_customers + 1, n_orders),
    'session_id': np.random.randint(1, 1001, n_orders),
    'browsing_time_minutes': np.random.exponential(15, n_orders),
    'pages_viewed': np.random.poisson(8, n_orders),
    'cart_adds': np.random.poisson(2, n_orders),
    'purchases': np.random.choice([0, 1], n_orders, p=[0.7, 0.3]),  # 30% conversion rate
    'campaign_source': np.random.choice(['Google Ads', 'Facebook', 'Email', 'Organic', 'Direct'], n_orders),
    'discount_applied': np.random.choice([0, 0.1, 0.15, 0.2], n_orders, p=[0.6, 0.2, 0.15, 0.05])
})

# Product catalog
products = pd.DataFrame({
    'product_id': range(1, n_products + 1),
    'name': [f'Product_{i}' for i in range(1, n_products + 1)],
    'category': np.random.choice(['Electronics', 'Clothing', 'Home', 'Books', 'Sports'], n_products),
    'price': np.random.uniform(10, 500, n_products),
    'inventory': np.random.randint(10, 100, n_products)
})

# Order details
orders = pd.DataFrame({
    'order_id': range(1, n_orders + 1),
    'customer_id': np.random.randint(1, n_customers + 1, n_orders),
    'order_date': [datetime.now() - timedelta(days=np.random.randint(1, 90)) for _ in range(n_orders)],
    'total_amount': np.random.uniform(25, 1000, n_orders),
    'shipping_cost': np.random.choice([0, 5, 10, 15], n_orders),
    'payment_method': np.random.choice(['Credit Card', 'PayPal', 'Apple Pay'], n_orders)
})